{"pageProps":{"blogs":[{"id":"exjm3q4q_beb","createdAt":"2023-12-29T08:10:46.359Z","updatedAt":"2023-12-29T08:10:46.359Z","publishedAt":"2023-12-29T08:10:46.359Z","revisedAt":"2023-12-29T08:10:46.359Z","title":"UWW2023","body":"<p>12/22, 23にUbiquitous Wearable Workshop 2023 (UWW 2023) @淡路夢舞台が開催された．<br>UWWは毎年私の所属する研究室が中心となって運営しており，私は運営のWebページ担当として参加し，研究発表も行った．<br>近年はコロナウイルスの流行により完全に対面での開催というのが難しかったが，今年はそれも収まり，コロナ以前の賑わいを取り戻したように思う．<br>参加者が多かったため発表時間は短く，質疑の時間も短めだったが，私は普段よりも良い発表ができた気がしている．<br>ナイトセッションでは，私が実装しているゲームを企画として体験してもらい，多くの方にフィードバックをもらうことができた．<br>ここ数週間はCE，WISS，UWWと学会参加が立て続けにあり，並行して別のプロジェクトのソフトウェア実装など慌しかったが，年末によい締めくくりができたのではないかと思う．<br><br>今年のUWWの発見は淡路島藻塩プリンが美味しいということ．</p>"},{"id":"3od02_gi66w","createdAt":"2023-12-24T07:48:16.839Z","updatedAt":"2023-12-24T07:53:54.172Z","publishedAt":"2023-12-24T07:48:16.839Z","revisedAt":"2023-12-24T07:53:54.172Z","title":"WISS2023参加備忘録","body":"<p>参加してから時間が空いてしまったが，11/29 - 12/1の間開催されたWISS2023に参加してきた．<br>開催場所は山梨県の八ヶ岳で，関西から向かおうとすると新幹線で名古屋まで出たあと，特急を2本乗り継がなければならず，なかなか大変な道中だった．<br>B4の後輩も発表があったため一緒に電車で向かったが，特急「しなの」の揺れがヤバく，会場に着くころには2人ともしおしおになってしまった．<br><br>会場のRoyal Hotel 八ヶ岳は綺麗な会場で，快適な環境で発表を聞くことができた．発表はハードウェアを使ったものからインタフェース系のものまで幅広く，また国際学会・国際論文誌採択論文発表ではトップカンファレンスやトップジャーナルに採録された研究の発表の多くを日本語で聞くことができ，貴重だった．<br>個人的には東大の鳴海紘也先生の発表「Inkjet 4D Print: Self-folding Tessellated Origami Objects by Inkjet UV Printing」が印象的だった．<br>UVプリンタで印刷したシートに，印刷後熱を加えると変形しあらかじめデザインしていた造形になる，というもので鳴海先生ご自身もUVプリンタで印刷した帽子を被って発表されていた．<br>デジタルファブリケーションに関する研究をあまり知らなかったし，自分もプログラムでデザインした幾何学的なものを物質的なものに落とし込むことには興味があるので，深掘りしてみようと思う．<br>自分は「プログラミング初学者の課題解決方針の立案能力を高める選択肢タップ式学習支援システム」というタイトルで初学者のためのプログラミング学習アプリケーションについて発表した．<br>議論枠という形で採録されたので，質疑では厳しい指摘をされるかと思ったがそんなことはなく，システムの詳細や応用について議論することができた．<br>WISSはデモ・ポスター発表のセッションがあり，パラレルに複数の研究のデモを行う時間があるのだが，エンタメ性の高いデモが多く刺激的だった．<br><br>1,2日目の夜に行われたナイトセッションは，会場での懇親会だけでなく持ち込み企画があり，イグノーベル賞受賞者の公演からお酒やゲーム等に関するプレゼンまで様々だった．<br>ここでHackforPlayを作った寺本さんに声をかけていただき，プログラミング教育や教育における生成AIについての議論をすることができ，かなり嬉しかった．<br><br>運営の方が良い研究発表の場所を作るために努力されていることが伝わってきて非常に良い会議だと思ったので，今後機会があればまた参加したいし，後輩にも積極的に参加していって欲しいと思う．<br><br>帰路の駅で食べた鹿そばがしみた．</p>"},{"id":"kn3bgwvdlja9","createdAt":"2023-11-08T15:05:52.442Z","updatedAt":"2023-11-09T06:38:22.903Z","publishedAt":"2023-11-08T15:06:09.531Z","revisedAt":"2023-11-09T06:38:22.903Z","title":"書くことについて思うこと","body":"<p> 自分にとっての執筆活動について考える．書くことは自分にとってどういう意味をもつのか．自分がきちんとした文章を書くのは主に論文とブログである．最近はX (旧: Twitter) をiPhoneからアンインストールしていたため，あまりSNS的な短文は書いていない．今年は，というかここ数年は論文を書くことが多かったので，自分の書く文章が自然と論文的な形をするようになってきた．それに気づいたのは最近で，別の場所でブログ記事を書いた際にあまりにそれが淡白だった．そもそも自分の文章がそれほど個性的なものだったとは思っていないが，何かの要素が削げ落ちたような気がした．単に自分の書いた文章を客観視できるようになっただけということもあるかもしれないが．<br><br>なので焦ってこの文章を書いているのかもしれない，ということを鑑みると，自分にとって書くという行為は何かしらの意味をもっている．私は文章を書くことがとくべつ得意だとは思わないが，書くことは好きなので，自己表現の方法の一つとしてそれをもっておきたいのかもしれない．<br><br> 気をてらった文章のよさ，というのがある．丁寧な文章でありながら，ややおどけているような文章．このような文章は森見登美彦や森鴎外の小説にみられる印象がある．自分はそんな文章の書き手になりたい．しかし，自分の主な執筆の媒体は小説ではなく論文である．自分はこのメディアのなかで自己表現ができるのだろうか．<br> 先日，大学の先生と会話している時，先生は文章の書き方についての本を書きたい，と仰っていた．私は谷崎潤一郎の文章読本のことを思った．</p>"},{"id":"1z05c8i1l","createdAt":"2023-07-04T14:25:46.213Z","updatedAt":"2023-07-05T03:13:02.643Z","publishedAt":"2023-07-04T14:26:10.948Z","revisedAt":"2023-07-05T03:13:02.643Z","title":"読書感想文: 『たのしいクリエイティブコーディング　Processingで学ぶコード×アート入門』","body":"<p> 「たのしいクリエイティブコーディング」という本を読んだ．<br>題名にある通りクリエイティブコーディングに関する本で，Processingを題材にクリエイティブコーディングの方法や，アイデアをコードで表現するためのプロセスなどについて解説している．<br><br> Processingを使った作法についての説明は，他の書籍と大きく変わらないと感じたが，「MOUNTROTHKO」という実際の作品を題材とし，プロジェクトをどう進めたかを解説していた点が興味深かった．制作プロセスをコードを交えるなどしてここまで細かく解説してくれる書籍は他にないのではないだろうか．特に，自分の考えたコンセプトをどう作品に落とし込んでいくか，どうコードで表現するか，といったところが書かれていたのは，自分が悩んでいる部分だったのでありがたかった．<br>また，作品を公開する際にどのような問題が起こりうるか (ネットがない，解像度・アス比が本番環境では違う，プロジェクタの赤色だけ使えない等) などにも触れており，実践的な面でも学ぶところがあった．<br><br> この本の原題は「Coding Art」らしいが，序盤で触れられている「アイデア (アート) のコード化」というフレーズが印象に残った．研究でもアートでもシステム開発でも，自分の思いついたアイデアをコード化するのは非常に難しいと感じるし，それは他の人も結構そうなんじゃないかと思う．特に，プログラミングの授業課題や競プロといった，閉じた文脈でのコーディングではなく，例えばカメラやセンサ，マイコンなどを扱った構成が複雑なシステムの開発ではそれが顕著なのではないかと思う．<br>ここら辺についてどのような支援がなされている/いないのか，何か自分ができることがないか，と考えたりしている．</p>"},{"id":"92yzms426x","createdAt":"2021-05-13T08:38:01.402Z","updatedAt":"2021-05-17T07:15:42.861Z","publishedAt":"2021-05-13T08:38:01.402Z","revisedAt":"2021-05-17T07:15:42.861Z","title":"Website updated!","body":"<p>I used to use Jekyll for SSG, but I switched it to Next.js, which is rumored to be fast. I've also been using Hatena Blog for my blog, but I wanted to write about technology and research, so I decided to use microCMS as HeadlessCMS.<br><br>In order to use p5.js from Next.js, I had to use a dynamic import of react-p5, which was a bit of a stumbling block, but overall it was a pretty easy transition!</p>"}]},"__N_SSG":true}