{"pageProps":{"blogs":[{"id":"kn3bgwvdlja9","createdAt":"2023-11-08T15:05:52.442Z","updatedAt":"2023-11-08T15:06:53.602Z","publishedAt":"2023-11-08T15:06:09.531Z","revisedAt":"2023-11-08T15:06:53.602Z","title":"書くことについて思うこと","body":"<p>自分にとっての執筆活動について考える．書くことは自分にとってどういう意味をもつのか．自分がきちんとした文章を書くのは主に論文とブログである．最近はX (旧: Twitter) をiPhoneからアンインストールしていたため，あまりSNS的な短文は書いていない．今年は，というかここ数年は論文を書くことが多かったので，自分の書く文章が自然と論文的な形をするようになってきた．それに気づいたのは最近で，別の場所でブログ記事を書いた際にあまりにそれが淡白だった．そもそも自分の文章がそれほど個性的なものだったとは思っていないが，何かの要素が削げ落ちたような気がした．単に自分の書いた文章を客観視できるようになっただけということもあるかもしれないが．<br><br>なので焦ってこの文章を書いているのかもしれない，ということを鑑みると，自分にとって書くという行為は何かしらの意味をもっている．私は文章を書くことがとくべつ得意だとは思わないが，書くことは好きなので，自己表現の方法の一つとしてそれをもっておきたいのかもしれない．<br><br>気をてらった文章のよさ，というのがある．丁寧な文章でありながら，ややおどけているような文章．このような文章は森見登美彦や森鴎外の小説にみられる印象がある．自分はそんな文章の書き手になりたい．しかし，自分の主な執筆の媒体は小説ではなく論文である．自分はこのメディアのなかで自己表現ができるのだろうか．<br>先日，大学の先生と会話している時，先生は文章の書き方についての本を書きたい，と仰っていた．私は谷崎潤一郎の陰翳礼讃のことを思った．</p>"},{"id":"1z05c8i1l","createdAt":"2023-07-04T14:25:46.213Z","updatedAt":"2023-07-05T03:13:02.643Z","publishedAt":"2023-07-04T14:26:10.948Z","revisedAt":"2023-07-05T03:13:02.643Z","title":"読書感想文: 『たのしいクリエイティブコーディング　Processingで学ぶコード×アート入門』","body":"<p> 「たのしいクリエイティブコーディング」という本を読んだ．<br>題名にある通りクリエイティブコーディングに関する本で，Processingを題材にクリエイティブコーディングの方法や，アイデアをコードで表現するためのプロセスなどについて解説している．<br><br> Processingを使った作法についての説明は，他の書籍と大きく変わらないと感じたが，「MOUNTROTHKO」という実際の作品を題材とし，プロジェクトをどう進めたかを解説していた点が興味深かった．制作プロセスをコードを交えるなどしてここまで細かく解説してくれる書籍は他にないのではないだろうか．特に，自分の考えたコンセプトをどう作品に落とし込んでいくか，どうコードで表現するか，といったところが書かれていたのは，自分が悩んでいる部分だったのでありがたかった．<br>また，作品を公開する際にどのような問題が起こりうるか (ネットがない，解像度・アス比が本番環境では違う，プロジェクタの赤色だけ使えない等) などにも触れており，実践的な面でも学ぶところがあった．<br><br> この本の原題は「Coding Art」らしいが，序盤で触れられている「アイデア (アート) のコード化」というフレーズが印象に残った．研究でもアートでもシステム開発でも，自分の思いついたアイデアをコード化するのは非常に難しいと感じるし，それは他の人も結構そうなんじゃないかと思う．特に，プログラミングの授業課題や競プロといった，閉じた文脈でのコーディングではなく，例えばカメラやセンサ，マイコンなどを扱った構成が複雑なシステムの開発ではそれが顕著なのではないかと思う．<br>ここら辺についてどのような支援がなされている/いないのか，何か自分ができることがないか，と考えたりしている．</p>"},{"id":"92yzms426x","createdAt":"2021-05-13T08:38:01.402Z","updatedAt":"2021-05-17T07:15:42.861Z","publishedAt":"2021-05-13T08:38:01.402Z","revisedAt":"2021-05-17T07:15:42.861Z","title":"Website updated!","body":"<p>I used to use Jekyll for SSG, but I switched it to Next.js, which is rumored to be fast. I've also been using Hatena Blog for my blog, but I wanted to write about technology and research, so I decided to use microCMS as HeadlessCMS.<br><br>In order to use p5.js from Next.js, I had to use a dynamic import of react-p5, which was a bit of a stumbling block, but overall it was a pretty easy transition!</p>"}]},"__N_SSG":true}